from function import *

# 25.	Написать собственную функцию, с аргументами возвращающую значение,
# для нахождения количества делителей введенного числа. 
# Функцию оформить как отдельный файл.

number = int(input("Введите число = "))
print("Количество делителей = ", delitel(number))