mas = []
# print("Что вы хотите сделать? 1 - сохранить свои данные 2 - просмотреть и изменить")
# pol = input("Ваш выбор => ")
# if pol == "1":
#     pol = ["Фамилия => ", "Имя => ", "Отчество => ", "Год рождения => ", "Номер телефона => ", "Адрес => "]
#     while len(mas) <= 5:
#         mas.append(input(pol[len(mas)]))
# elif pol == "2":
#     print("Что вас интересует? 1 - Фамилия, 2 - Имя, 3 - Отчество, 4 - год рождения, 5 - номер телефона, 6 - адрес")
#     a = int(input())
#     if a >=1 and a <=6:
#         print(pol[a])
# else:
#     print("Такой операции нет")
